# CreaseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCrease..::..CreaseType Property
SlabShapeCrease Class See Also
---
The type of the crease.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeCreaseType CreaseType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CreaseType As SlabShapeCreaseType
	Get
```

Visual C++
---
```text
public:
property SlabShapeCreaseType CreaseType {
	SlabShapeCreaseType get ();
}
```

# See Also
SlabShapeCrease Class
Autodesk.Revit.DB Namespace